#include "global.h"
#include "core.h"
#include "game/stage/screen_fade.h"
#include "game/stage/stage.h"
#include "sprite.h"
#include "game/character_select.h"
#include "game/save.h"
#include "lib/m4a/m4a.h"
#include "task.h"
#include "malloc_vram.h"
#include "flags.h"
#include "trig.h"
#include "game/multiplayer/multipak_connection.h"
#include "game/multiplayer/results.h"
#include "game/options_screen.h"
#include "game/course_select.h"
#include "game/title_screen.h"
#include "game/time_attack/lobby.h"
#include "game/time_attack/mode_select.h"

#include "constants/animations.h"
#include "constants/songs.h"
#include "constants/text.h"
#include "constants/tilemaps.h"

struct CharacterSelectionScreen {
    /* 0x00 */ ScreenFade fade;
    /* 0x0C */ Background unkC;
    /* 0x4C */ Background unk4C;
    /* 0x8C */ Background unk8C;
    /* 0xCC */ Sprite screenTitleText;
    /* 0xFC */ Sprite characterSprite;
    /* 0x12C */ Sprite characterNameSubText;

    /* 0x15C */ Sprite characterTitleTextLeft;
    /* 0x18C */ SpriteTransform characterTitleLeftTransform;

    /* 0x198 */ Sprite characterTitleTextRight;
    /* 0x1C8 */ SpriteTransform characterTitleRightTransform;

    /* 0x1D4 */ Sprite carouselBlobs[NUM_CHARACTERS];
    /* 0x2C4 */ Sprite selectedCarouselBlob;
    /* 0x2F4 */ SpriteTransform selectedBlobTransform;

    /* 0x300 */ Sprite scrollUpArrow;
    /* 0x330 */ Sprite scrollDownArrow;

    /* 0x360 */ Sprite characterSecondarySprite;
    /* 0x390 */ Sprite characterUnavailableIndicator;
    /* 0x3C0 */ u8 initialSelection;
    /* 0x3C1 */ u8 selectedCharacter;
    /* 0x3C2 */ u8 previousSelection;

    /* 0x3C3 */ bool8 amyUnlocked;

    /* 0x3C4 */ u8 unk3C4;

    /* 0x3C5 */ u8 cursorAnimFrame;

    /* 0x3C6 */ u8 upArrowActviteFrames;
    /* 0x3C7 */ u8 downArrowActiveFrames;

    /* 0x3C8 */ bool8 selectionComplete;
    /* 0x3C9 */ bool8 exiting;
    /* 0x3CA */ u8 availableCharacters;

    /* 0x3CB */ bool8 scrollingDown;

    /* 0x3CC */ u8 confirmationHandshakeAttempts;

    /* 0x3CE */ u16 characterBaseXPos;
    /* 0x3D0 */ u16 characterSubTextBaseXPos;

    /* 0x3D4 */ u32 animFrame;
    /* 0x3D8 */ u32 carouselPosition;
    /* 0x3DC */ u32 multiplayerSelections;
}; /* size 0x3E0 */

static void CharacterSelectScreenOnDestroy(struct Task *);
static void Task_CharacterSelectMain(void);

static void Task_FadeInAndStartRollInAnim(void);
static void Task_RollInAnim(void);
static void RenderCarouselRollInAnim(struct CharacterSelectionScreen *characterScreen);

static void Task_TransitionInUIAnim(void);
static void RenderTransitionInUIAnim(struct CharacterSelectionScreen *characterScreen);

static void Task_HandleCarouselScrollUp(void);
static void Task_HandleCarouselScrollDown(void);
static void Task_CarouselScrollCompleteAnim(void);
static void RenderCarouselScrollAnim(struct CharacterSelectionScreen *characterScreen);

static void Task_SelectionCompleteFadeOutAndExit(void);
static void Task_MultiplayerWaitForSelections(void);
static void Task_MultiplayerVerifySelections(void);

static void Task_FadeOutAndExitToPrevious(void);

static void RenderUI(struct CharacterSelectionScreen *);

