#include "global.h"
#include "flags.h"
#include "malloc_vram.h"
#include "game/game.h"
#include "game/bosses/common.h"
#include "game/countdown.h"
#include "game/player_actions.h"
#include "game/player_mp_actor.h"
#include "game/screen_transition.h"
#include "game/stage/ui.h"

#include "constants/animations.h"
#include "constants/zones.h"

#define INTRO_ICON_LEAF_FOREST  0
#define INTRO_ICON_HOT_CRATAER  1
#define INTRO_ICON_MUSIC_PLANT  2
#define INTRO_ICON_ICE_PARADISE 3
#define INTRO_ICON_SKY_CANYON   4
#define INTRO_ICON_TECHNO_BASE  5
#define INTRO_ICON_EGG_UTOPIA   6
#define INTRO_ICON_XX           7
#define INTRO_ICON_TRUE_AREA_53 8
#define INTRO_ICON_BOSS_ATTACK  9
#define NUM_INTRO_STAGE_ICONS   9

// includes Boss Attack
#define NUM_INTRO_UNLOCKED_STAGES_ICONS (NUM_INTRO_STAGE_ICONS + 1)

// (Stage-Courses + XX + True Area 53) == 9
#define NUM_ZONE_UNLOCKED_ICONS  (NUM_COURSE_ZONES + 2)
#define NUM_ZONE_NAME_PARTS      4
#define ZONE_NAME_INDEX_TA53     32
#define ZONE_NAME_INDEX_BOSS_ATK 36

// The colored logo next to the stage name
static const u16 zoneLoadingCharacterLogos[NUM_CHARACTERS][3] = {
    [CHARACTER_SONIC] = { 9, SA2_ANIM_STAGE_INTRO_CHARACTER_LOGO, 0 },
    [CHARACTER_CREAM] = { 9, SA2_ANIM_STAGE_INTRO_CHARACTER_LOGO, 3 },
    [CHARACTER_TAILS] = { 9, SA2_ANIM_STAGE_INTRO_CHARACTER_LOGO, 1 },
    [CHARACTER_KNUCKLES] = { 9, SA2_ANIM_STAGE_INTRO_CHARACTER_LOGO, 2 },
    [CHARACTER_AMY] = { 9, SA2_ANIM_STAGE_INTRO_CHARACTER_LOGO, 4 },
};


//       This is u8[][3], each byte being one RGB channel(0-31)
#if 0
extern const u8 gUnknown_080D6FF5[];
#else
const u8 gUnknown_080D6FF5[][3] = {
    { 0x00, 0x17, 0x06 }, { 0x16, 0x16, 0x16 }, { 0x00, 0x04, 0x13 },
    { 0x00, 0x08, 0x1D }, { 0x00, 0x00, 0x0C }, { 0x00, 0x13, 0x00 },
    { 0x1F, 0x1F, 0x13 }, { 0x1F, 0x1B, 0x00 }, { 0x13, 0x0A, 0x02 },
    { 0x1F, 0x15, 0x0A }, { 0x15, 0x00, 0x00 }, { 0x1F, 0x04, 0x04 },
    { 0x04, 0x04, 0x04 }, { 0x1F, 0x1F, 0x1F }, { 0x0E, 0x0E, 0x0E },
    { 0x00, 0x13, 0x1F }, { 0x00, 0x19, 0x14 }, { 0x19, 0x19, 0x19 },
    { 0x1F, 0x0B, 0x00 }, { 0x1F, 0x12, 0x00 }, { 0x19, 0x05, 0x00 },
    { 0x1C, 0x0B, 0x00 }, { 0x13, 0x00, 0x00 }, { 0x1F, 0x1C, 0x17 },
    { 0x1D, 0x18, 0x10 }, { 0x13, 0x0F, 0x08 }, { 0x1F, 0x1E, 0x00 },
    { 0x08, 0x11, 0x1F }, { 0x02, 0x02, 0x02 }, { 0x1F, 0x1F, 0x1F },
    { 0x0E, 0x0E, 0x0E }, { 0x1F, 0x00, 0x1F }, { 0x00, 0x17, 0x06 },
    { 0x1F, 0x00, 0x1F }, { 0x1D, 0x11, 0x04 }, { 0x1F, 0x17, 0x04 },
    { 0x17, 0x0A, 0x02 }, { 0x15, 0x19, 0x1B }, { 0x00, 0x13, 0x1F },
    { 0x04, 0x08, 0x1F }, { 0x13, 0x13, 0x13 }, { 0x0E, 0x0E, 0x0E },
    { 0x15, 0x00, 0x00 }, { 0x1F, 0x04, 0x04 }, { 0x02, 0x02, 0x02 },
    { 0x1F, 0x1F, 0x1F }, { 0x1F, 0x00, 0x1F }, { 0x1F, 0x00, 0x1F },
    { 0x00, 0x16, 0x14 }, { 0x16, 0x16, 0x16 }, { 0x17, 0x00, 0x00 },
    { 0x1F, 0x04, 0x00 }, { 0x0E, 0x00, 0x00 }, { 0x04, 0x08, 0x1F },
    { 0x1F, 0x1F, 0x13 }, { 0x1F, 0x1B, 0x00 }, { 0x13, 0x0A, 0x00 },
    { 0x1F, 0x15, 0x0A }, { 0x00, 0x15, 0x02 }, { 0x0E, 0x1F, 0x00 },
    { 0x04, 0x04, 0x04 }, { 0x1F, 0x1F, 0x1F }, { 0x0E, 0x0E, 0x0E },
    { 0x1F, 0x13, 0x00 }, { 0x00, 0x17, 0x06 }, { 0x15, 0x19, 0x1B },
    { 0x1D, 0x08, 0x13 }, { 0x1F, 0x13, 0x17 }, { 0x17, 0x04, 0x0A },
    { 0x00, 0x15, 0x00 }, { 0x0E, 0x0E, 0x0E }, { 0x13, 0x13, 0x13 },
    { 0x13, 0x0A, 0x00 }, { 0x1F, 0x15, 0x0A }, { 0x15, 0x00, 0x00 },
    { 0x1F, 0x00, 0x00 }, { 0x00, 0x00, 0x00 }, { 0x1F, 0x1F, 0x1F },
    { 0x1F, 0x1F, 0x13 }, { 0x1F, 0x1F, 0x00 }, { 0x00, 0x12, 0x0B },
    { 0x04, 0x06, 0x0A }, { 0x00, 0x1F, 0x00 }, { 0x1F, 0x1F, 0x1F },
    { 0x14, 0x1F, 0x1F }, { 0x10, 0x1C, 0x1E }, { 0x0C, 0x18, 0x19 },
    { 0x09, 0x14, 0x15 }, { 0x00, 0x0E, 0x10 }, { 0x00, 0x1F, 0x00 },
    { 0x1F, 0x16, 0x18 }, { 0x1F, 0x0A, 0x10 }, { 0x1F, 0x1E, 0x00 },
    { 0x19, 0x18, 0x00 }, { 0x13, 0x0A, 0x00 }, { 0x1F, 0x00, 0x00 },
};
#endif

const u16 sZoneLoadingCharacterColors[NUM_CHARACTERS] = {
    [CHARACTER_SONIC] = RGB(0, 0, 31),  [CHARACTER_CREAM] = RGB(31, 18, 0),
    [CHARACTER_TAILS] = RGB(31, 27, 0), [CHARACTER_KNUCKLES] = RGB(31, 3, 0),
    [CHARACTER_AMY] = RGB(31, 17, 21),
};

const u16 sScreenPositions_ZoneLoadingActLetters[4][2] = {
    { DISPLAY_WIDTH - 108, DISPLAY_HEIGHT - 63 }, // A
    { DISPLAY_WIDTH - 87, DISPLAY_HEIGHT - 59 }, // C
    { DISPLAY_WIDTH - 66, DISPLAY_HEIGHT - 55 }, // T
    { DISPLAY_WIDTH - 44, DISPLAY_HEIGHT - 51 }, // 1|2
};

const u16 gUnknown_080D7130[3][2] = {
    { 10, -8 },
    { 6, -4 },
    { 2, 0 },
};

typedef struct {
    /* 0x00 */ u32 counter;
    /* 0x04 */ bool8 skippedIntro;
} SITaskA; /* size: 0x8 */

// TODO: Are SITaskB/C/F the same struct?
typedef struct {
    /* 0x00 */ SITaskA *parent;
    /* 0x04 */ struct TransitionState transition;
    /* 0x10 */ Vec2_16 unk10;
    /* 0x14 */ Vec2_16 unk14;
} SITaskB; /* size: 0x18 */

typedef struct {
    /* 0x00 */ SITaskA *parent;
    /* 0x04 */ Sprite sUnlockedIcons[9];
    /* 0x1B4 */ Sprite sCharacterLogo;
    /* 0x1E4 */ Sprite sStageName[4];
    /* 0x2A4 */ Sprite s2A4;
    /* 0x2D4 */ Sprite s2D4;
    /* 0x314 */ u8 filler4[0xC];
} SITaskD; /* size: 0x310 */

typedef struct {
    /* 0x00 */ SITaskA *parent;
    /* 0x04 */ Sprite sStageNames[4];
} SITaskE; /* size: 0xC4 */

void Task_802F75C(void);
void Task_802F9F8(void);
void Task_802FD34(void);
void Task_802FF94(void);
void Task_80302AC(void);
void Task_UpdateStageLoadingScreen(void);
void TaskDestructor_80303CC(struct Task *);
void TaskDestructor_nop_8030458(struct Task *);
void TaskDestructor_803045C(struct Task *);
void TaskDestructor_8030474(struct Task *);

// (99.66%) https://decomp.me/scratch/zGPtO
NONMATCH("asm/non_matching/game/stage/intro/SetupStageIntro.inc",
         struct Task *SetupStageIntro(void))
{
    struct Task *t; // sp04
    SITaskA *sit_a; // sp08
    struct Task *t2;
    SITaskB *sit_b;
    // SITaskC *sit_c;
    SITaskD *sit_d; // r8
    SITaskE *sit_e;
    // SITaskF *sit_f;
    struct TransitionState *transition;
    Vec2_16 *vec;
    void *tilesCursor;
    Sprite *s;
    u8 i; // r7

    gUnknown_03005424 |= EXTRA_STATE__ACT_START;
    gUnknown_03005424 |= EXTRA_STATE__100;

