#include "global.h"
#include "flags.h"
#include "malloc_vram.h"
#include "trig.h"
#include "game/sa1_sa2_shared/globals.h"
#include "game/stage/player.h"
#include "game/cheese.h"
#include "game/stage/screen_mask.h"
#include "game/bosses/common.h"
#include "game/countdown.h"
#include "game/boost_effect.h"
#include "game/multiplayer/mp_player.h"
#include "game/stage/screen_fade.h"
#include "game/stage/ui.h"
#include "game/stage/boss_results_transition.h"
#include "game/water_effects.h"

#include "constants/animations.h"
#include "constants/zones.h"

#define INTRO_ICON_LEAF_FOREST  0
#define INTRO_ICON_HOT_CRATAER  1
#define INTRO_ICON_MUSIC_PLANT  2
#define INTRO_ICON_ICE_PARADISE 3
#define INTRO_ICON_SKY_CANYON   4
#define INTRO_ICON_TECHNO_BASE  5
#define INTRO_ICON_EGG_UTOPIA   6
#define INTRO_ICON_XX           7
#define INTRO_ICON_TRUE_AREA_53 8
#define INTRO_ICON_BOSS_ATTACK  9
#define NUM_INTRO_STAGE_ICONS   9

// includes Boss Attack
#define NUM_INTRO_UNLOCKED_STAGES_ICONS (NUM_INTRO_STAGE_ICONS + 1)

// (Stage-Courses + XX + True Area 53) == 9
#define NUM_ZONE_UNLOCKED_ICONS  (NUM_COURSE_ZONES + 2)
#define NUM_ZONE_NAME_PARTS      4
#define ZONE_NAME_INDEX_TA53     32
#define ZONE_NAME_INDEX_BOSS_ATK 36

#define INTROFRAME_VISIBLE         1
#define INTROFRAME_BANNER_APPEARS  7
#define INTROFRAME_NAME_AND_BANNER 10
#define INTROFRAME_PAUSE_ON_BANNER 120
#define INTROFRAME_CLEAR_BANNER    136
#define INTROFRAME_FADE_GAMEPLAY   150


        { 0x1F, 0x0B, 0x00 },
        { 0x1F, 0x12, 0x00 },
        { 0x19, 0x05, 0x00 },
        { 0x1C, 0x0B, 0x00 },
        { 0x13, 0x00, 0x00 },
        { 0x1F, 0x1C, 0x17 },
        { 0x1D, 0x18, 0x10 },
        { 0x13, 0x0F, 0x08 },
        { 0x1F, 0x1E, 0x00 },
        { 0x08, 0x11, 0x1F },
        { 0x02, 0x02, 0x02 },
        { 0x1F, 0x1F, 0x1F },
        { 0x0E, 0x0E, 0x0E },
        { 0x1F, 0x00, 0x1F },
    },
    {
        { 0x00, 0x17, 0x06 },
        { 0x1F, 0x00, 0x1F },
        { 0x1D, 0x11, 0x04 },
        { 0x1F, 0x17, 0x04 },
        { 0x17, 0x0A, 0x02 },
        { 0x15, 0x19, 0x1B },
        { 0x00, 0x13, 0x1F },
        { 0x04, 0x08, 0x1F },
        { 0x13, 0x13, 0x13 },
        { 0x0E, 0x0E, 0x0E },
        { 0x15, 0x00, 0x00 },
        { 0x1F, 0x04, 0x04 },
        { 0x02, 0x02, 0x02 },
        { 0x1F, 0x1F, 0x1F },
        { 0x1F, 0x00, 0x1F },
        { 0x1F, 0x00, 0x1F },
    },
    {
        { 0x00, 0x16, 0x14 },
        { 0x16, 0x16, 0x16 },
        { 0x17, 0x00, 0x00 },
        { 0x1F, 0x04, 0x00 },
        { 0x0E, 0x00, 0x00 },
        { 0x04, 0x08, 0x1F },
        { 0x1F, 0x1F, 0x13 },
        { 0x1F, 0x1B, 0x00 },
        { 0x13, 0x0A, 0x00 },
        { 0x1F, 0x15, 0x0A },
        { 0x00, 0x15, 0x02 },
        { 0x0E, 0x1F, 0x00 },
        { 0x04, 0x04, 0x04 },
        { 0x1F, 0x1F, 0x1F },
        { 0x0E, 0x0E, 0x0E },
        { 0x1F, 0x13, 0x00 },
    },
    {
        { 0x00, 0x17, 0x06 },
        { 0x15, 0x19, 0x1B },
        { 0x1D, 0x08, 0x13 },
        { 0x1F, 0x13, 0x17 },
        { 0x17, 0x04, 0x0A },
        { 0x00, 0x15, 0x00 },
        { 0x0E, 0x0E, 0x0E },
        { 0x13, 0x13, 0x13 },
        { 0x13, 0x0A, 0x00 },
        { 0x1F, 0x15, 0x0A },
        { 0x15, 0x00, 0x00 },
        { 0x1F, 0x00, 0x00 },
        { 0x00, 0x00, 0x00 },
        { 0x1F, 0x1F, 0x1F },
        { 0x1F, 0x1F, 0x13 },
        { 0x1F, 0x1F, 0x00 },
    },
    {
        { 0x00, 0x12, 0x0B },
        { 0x04, 0x06, 0x0A },
        { 0x00, 0x1F, 0x00 },
        { 0x1F, 0x1F, 0x1F },
        { 0x14, 0x1F, 0x1F },
        { 0x10, 0x1C, 0x1E },
        { 0x0C, 0x18, 0x19 },
        { 0x09, 0x14, 0x15 },
        { 0x00, 0x0E, 0x10 },
        { 0x00, 0x1F, 0x00 },
        { 0x1F, 0x16, 0x18 },
        { 0x1F, 0x0A, 0x10 },
        { 0x1F, 0x1E, 0x00 },
        { 0x19, 0x18, 0x00 },
        { 0x13, 0x0A, 0x00 },
        { 0x1F, 0x00, 0x00 },
    },
};

const u16 sZoneLoadingCharacterColors[NUM_CHARACTERS] = {
    [CHARACTER_SONIC] = RGB16(0, 0, 31),    [CHARACTER_CREAM] = RGB16(31, 18, 0), [CHARACTER_TAILS] = RGB16(31, 27, 0),
    [CHARACTER_KNUCKLES] = RGB16(31, 3, 0), [CHARACTER_AMY] = RGB16(31, 17, 21),
};

const u16 sScreenPositions_ZoneLoadingActLetters[4][2] = {
    { DISPLAY_WIDTH - 108, DISPLAY_HEIGHT - 63 }, // A
    { DISPLAY_WIDTH - 87, DISPLAY_HEIGHT - 59 }, // C
    { DISPLAY_WIDTH - 66, DISPLAY_HEIGHT - 55 }, // T
    { DISPLAY_WIDTH - 44, DISPLAY_HEIGHT - 51 }, // 1|2
};

const s16 gUnknown_080D7130[6] = { 10, -8, 6, -4, 2, 0 };

typedef struct {
    /* 0x00 */ u32 counter;
    /* 0x04 */ bool8 skippedIntro;
} IntroController; /* size: 0x8 */

typedef struct {
    u16 y;
    u16 angle;
} ScreenMaskValues;

// TODO: Are IntroBackgrounds/C/F the same struct?
typedef struct {
    /* 0x00 */ IntroController *controller;
    /* 0x04 */ ScreenFade fade;
    /* 0x10 */ ScreenMaskValues mask1;
    /* 0x14 */ ScreenMaskValues mask2;
} IntroBackgrounds; /* size: 0x18 */

typedef struct {
    /* 0x00 */ IntroController *controller;
    /* 0x04 */ Sprite sprUnlockedIcons[9];
    /* 0x1B4 */ Sprite sprCharacterLogo;
    /* 0x1E4 */ Sprite sprZoneName[4];
    /* 0x2A4 */ Sprite sprLoadingWheel;
    /* 0x2D4 */ Sprite sprLoadingWheelIcon;
    /* 0x304 */ SpriteTransform transform;
} IntroUI; /* size: 0x310 */

typedef struct {
    /* 0x00 */ IntroController *controller;
    /* 0x04 */ Sprite sprZoneNames[4];
} IntroActLetters; /* size: 0xC4 */

static void Task_IntroControllerMain(void);
static void Task_802F9F8(void);
static void Task_IntroColorAnimation(void);
static void Task_IntroZoneNameAndIconAnimations(void);
static void Task_IntroActLettersAnimations(void);
static void Task_UpdateStageLoadingScreen(void);
static void TaskDestructor_IntroController(struct Task *);
static void TaskDestructor_Dummy(struct Task *);
static void TaskDestructor_803045C(struct Task *);
static void TaskDestructor_8030474(struct Task *);

struct Task *SetupStageIntro(void)
{
    struct Task *t; // sp04
    IntroController *introController; // sp08
    struct Task *t2;
    ScreenFade *fade;
    IntroBackgrounds *introBackgrounds;
    // SITaskC *sit_c;
    IntroUI *introUI; // r8
    IntroActLetters *introActLetters;
    // SITaskF *sit_f;
    ScreenMaskValues *mask;
    void *tilesCursor;
    Sprite *s;
    u8 i; // r7

    gStageFlags |= STAGE_FLAG__ACT_START;
