#include "global.h"
#include "core.h"
#include "trig.h"
#include "lib/m4a/m4a.h"
#include "rect.h"

#include "game/sa1_sa2_shared/globals.h"

#include "game/stage/terrain_collision.h"
#include "game/stage/player.h"
#include "game/stage/camera.h"

#include "game/stage/rings_scatter.h"
#include "game/sa1_sa2_shared/collect_ring_effect.h"
#include "game/sa1_sa2_shared/rings_manager.h"

#include "constants/animations.h"
#include "constants/songs.h"

#if (GAME == GAME_SA1)
#define MAX_SCATTERING_RINGS_COUNT_SP 48
#define MAX_SCATTERING_RINGS_COUNT_MP 32
#elif (GAME == GAME_SA2)
#define MAX_SCATTERING_RINGS_COUNT_SP 32
#define MAX_SCATTERING_RINGS_COUNT_MP 16
#endif

#if (GAME == GAME_SA1)
#define UNK10_CONDITION 1
#elif (GAME == GAME_SA2)
#define UNK10_CONDITION !(ring->unk10 & 0x7)
#endif

#define USE_HITBOX_RECT 1

// TODO: Use improved version of these globaly!
#define HB_ALT_LEFT(p, hb)   (I((p)->qWorldX) + (hb)->left)
#define HB_ALT_WIDTH(hb)     ((hb)->right - (hb)->left)
#define HB_ALT_RIGHT(p, hb)  (I((p)->qWorldX) + HB_ALT_WIDTH(hb))
#define HB_ALT_TOP(p, hb)    (I((p)->qWorldY) + (hb)->top)
#define HB_ALT_HEIGHT(hb)    ((hb)->bottom - (hb)->top)
#define HB_ALT_BOTTOM(p, hb) (I((p)->qWorldY) + HB_ALT_HEIGHT(hb))

typedef struct {
    /* 0x00 */ s32 x;
    /* 0x04 */ s32 y;
    /* 0x08 */ s16 velX;
    /* 0x0A */ s16 velY;
    /* 0x0C */ u16 unkC;
    /* 0x0E */ s16 unkE;
#if (GAME == GAME_SA2)
    /* 0x10 */ u16 unk10;
#endif
} ScatterRing; /* size: 0x14 */

typedef struct {
    /* 0x000 */ Sprite sprRing;
    /* 0x030 */ ScatterRing rings[MAX_SCATTERING_RINGS_COUNT_SP];
    /* 0x2B0 */ u32 unk2B0;
    /* 0x2B4 */ u16 unk2B4;
    /* 0x2B6 */ u16 unk2B6;
} RingsScatter; /* size: 0x2B8 */

struct Task *gRingsScatterTask = NULL;

void Task_RingsScatter_Singleplayer(void);
void Task_RingsScatter_MP_Singlepak(void);
void Task_RingsScatter_MP_Multipak(void);
void TaskDestructor_RingsScatter(struct Task *);

// Called on Stage Initialization
void InitPlayerHitRingsScatter(void)
{
#ifndef NON_MATCHING
    register TaskMain taskFn asm("r0");
#else
    TaskMain taskFn;
#endif
    RingsScatter *rs;
    Sprite *s;
    struct Task **tgtTask;
    struct Task *t;
    void *dmaDest;
    u32 size;

#if (GAME == GAME_SA1)
    if (IS_MULTI_PLAYER) {
        tgtTask = &gRingsScatterTask;
        taskFn = Task_RingsScatter_MP_Multipak;
    } else {
        tgtTask = &gRingsScatterTask;
        taskFn = Task_RingsScatter_Singleplayer;
    }
#elif (GAME == GAME_SA2)
#ifndef COLLECT_RINGS_ROM
    if (gGameMode != GAME_MODE_MULTI_PLAYER_COLLECT_RINGS) {
        if (IS_SINGLE_PLAYER) {
            tgtTask = &gRingsScatterTask;
