#include "core.h"
#include "sprite.h"
#include "task.h"
#include "malloc_vram.h"
#include "trig.h"

#include "game/game.h"
#include "game/save.h"
#include "game/bosses/common.h"
#include "game/bosses/eggmobile_escape_sequence.h"
#include "game/player_callbacks_1.h"

#include "game/screen_transition.h"

#include "lib/m4a.h"
#include "constants/songs.h"
#include "constants/zones.h"
#include "constants/animations.h"
#include "flags.h"

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4; // x
    /* 0x08 */ s32 unk8; // y

    /* 0x0C */ s16 unkC; // speedX
    /* 0x0E */ s16 unkE; // speedY

    /* 0x10 */ u8 unk10;
    /* 0x11 */ u8 unk11;
    /* 0x12 */ u8 unk12;
    /* 0x13 */ u8 unk13;
    /* 0x14 */ u8 unk14;
    /* 0x15 */ u8 unk15;

    /* 0x16 */ u16 unk16;
    /* 0x18 */ u16 unk18;
    /* 0x1A */ u16 unk1A;
    /* 0x1C */ u16 unk1C;

    /* 0x1E */ u8 unk1E;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ u8 unk20;

    /* 0x22 */ s16 unk22;
    /* 0x24 */ s16 unk24;

    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;

    /* 0x30 */ u16 unk30;
    /* 0x32 */ u16 unk32;

    /* 0x34 */ s16 unk34;

    /* 0x36 */ s16 unk36[2][32];
    /* 0xB6 */ u8 unkB6;

    /* 0xB8 */ s16 unkB8;
    /* 0xBA */ s16 unkBA;
    /* 0xBC */ u16 unkBC;

    /* 0xBE */ u8 unkBE;
    /* 0xBF */ u8 unkBF;
    /* 0xC0 */ u8 unkC0;

    /* 0xC4 */ s32 unkC4;
    /* 0xC8 */ s32 unkC8;

    /* 0xCC */ s32 unkCC;
    /* 0xD0 */ s32 unkD0;

    /* 0xD4 */ s16 unkD4;
    /* 0xD6 */ s16 unkD6;

    /* 0xD8 */ s16 unkD8;
    /* 0xDA */ s16 unkDA;

    /* 0xDC */ s32 unkDC[6][2];

    /* 0x10C */ s16 unk10C[6][2];

    /* 0x124 */ s32 unk124;
    /* 0x128 */ s32 unk128;
    /* 0x12C */ s16 unk12C;
    /* 0x12E */ s16 unk12E;

    /* 0x130 */ s16 unk130; // timer

    /* 0x134 */ struct TransitionState unk134;

    /* 0x140 */ Sprite unk140; // disk
    /* 0x170 */ Sprite unk170; // cabin

    /* 0x1A0 */ Sprite_UNK28 unk1A0[2]; // maybe

    /* 0x1B0 */ Sprite unk1B0; // pilot
    /* 0x1E0 */ Sprite unk1E0; // gun
    /* 0x210 */ Sprite_UNK28 unk210; // maybe

    /* 0x218 */ Sprite unk218; // gun base

    /* 0x248 */ s8 unk248[8];
    /* 0x250 */ SpriteTransform transform;

    /* 0x25C */ Sprite unk25C; // gun projectile
    /* 0x28C */ Sprite unk28C; // arm base
    /* 0x2BC */ Sprite_UNK28 unk2BC; // maybe

    /* 0x2C4 */ Sprite unk2C4; // arm segment
    /* 0x2F4 */ Sprite unk2F4; // hand
    /* 0x324 */ Sprite_UNK28 unk324; // maybe

    /* 0x32C */ Sprite unk32C[8]; // smackParticle

    /* 0x4AC */ void *vram;
} EggSaucer; /* 0x4B0 */

extern const TileInfo gUnknown_080D7FB0[];
extern const TileInfo gUnknown_080D79D0[];
extern const u16 gUnknown_080D7F94[2];

// stage intro related
extern void sub_802EF68(s16, s16, u8);

void Task_EggSaucerMain(void);
void TaskDestructor_EggSaucerMain(struct Task *);

#define BOSS_SPEED            5
#define BOSS_INTRO_SPEED      4
#define BOSS_ROTATE_SPEED_DEG 0.7038123167155426 // 2 sin units

#define BOSS_HEIGHT 100

void CreateEggSaucer(void)
{
    u8 i;
    u32 r2;
    EggSaucer *boss;
    struct TransitionState *unk134;
    Sprite *s;
    void *vram;
    void *vramBase;

    gDispCnt |= 0x100;
    gBgCntRegs[0] = 0x560D;
    gBgScrollRegs[0][0] = 0;
    gBgScrollRegs[0][1] = 0;

    gUnknown_03004D80[0] = 0;

    gUnknown_03002280[0][0] = 0;
    gUnknown_03002280[0][1] = 0;
    gUnknown_03002280[0][2] = 0xff;
    gUnknown_03002280[0][3] = 64;

    gPlayer.moveState |= MOVESTATE_IGNORE_INPUT;

    sub_8039ED4();
