#if TAS_TESTING
#include <stdlib.h>
#include <stdio.h>
#endif

#include "global.h"
#include "flags.h"
#include "task.h"
#include "trig.h"
#include "bg_triangles.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/sa1_sa2_shared/globals.h"
#include "game/sa1_sa2_shared/camera.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/sa1_sa2_shared/player.h"
#include "game/bosses/common.h"
#include "game/player_callbacks.h" // UpdateHomingPosition
#include "game/cheese.h"
#include "game/stage/camera.h"
#include "game/stage/player.h"
#include "game/stage/results.h"
#include "game/stage/boss_results_transition.h"
#include "game/stage/screen_mask.h"
#include "game/stage/screen_fade.h"
#include "game/stage/screen_shake.h"

#include "constants/animations.h"
#include "constants/char_states.h"
#include "constants/move_states.h"
#include "constants/player_transitions.h"
#include "constants/songs.h"
#include "constants/tilemaps.h"

#define ARM_LEFT   0
#define ARM_RIGHT  1
#define ARM_COUNT  2
#define NUM_TOWERS 3

typedef struct {
    /* 0x00 */ Sprite s;
    /* 0x30 */ SpriteTransform transform;
} BossSprite;

typedef struct {
    /*  0x00 */ Vec2_32 qPos;
    /*  0x08 */ u8 livesCockpit;
    /*  0x09 */ u8 livesArms[ARM_COUNT];
    /*  0x0B */ u8 unkB;
    /*  0x0C */ u8 unkC;
    /*  0x0E */ u16 unkE;
    /*  0x10 */ u16 unk10; // rotationHead ?
    /*  0x12 */ u8 unk12;
    /*  0x14 */ u32 unk14;
    /*  0x18 */ Vec2_32 qUnk18[ARM_COUNT];
    /*  0x28 */ u16 rotation[ARM_COUNT];
    /*  0x2C */ u16 rotation2[ARM_COUNT];
    /*  0x30 */ u16 unk30[ARM_COUNT];
    /*  0x34 */ s16 qUnk34[ARM_COUNT][2];
    /*  0x3C */ u8 unk3C[ARM_COUNT];
    /*  0x3E */ u8 unk3E[ARM_COUNT];
    /*  0x40 */ u8 unk40[ARM_COUNT];
    /*  0x42 */ u8 unk42[ARM_COUNT];
    /*  0x44 */ void *tilesCloud;
    /*  0x48 */ ScreenFade fade;
    /*  0x54 */ BossSprite bsHead;
    /*  0x90 */ BossSprite bsArms[ARM_COUNT];
    /* 0x108 */ Background body;
} SuperEggRoboZ; /* size: 0x148 */

typedef struct {
    u16 unk0;
    u16 unk2;
    u8 bossIndex;
    u8 unk5;
    u8 unk6;
} BossRunManager;

typedef struct {
    Sprite sprites[NUM_TOWERS][2];
    void *vram;
    Vec2_32 positions[NUM_TOWERS];
    Vec2_32 offsets[NUM_TOWERS];
    u16 unk154[NUM_TOWERS];
    u8 unk15A[NUM_TOWERS];
    u8 unk15D;
    u8 unk15E;
    u8 unk15F;
    SuperEggRoboZ *boss;
} SuperEggRoboZTowers; /* 0x164 */

typedef void (*EggRoboFn)(SuperEggRoboZ *boss, u8 arm);
typedef void (*SuperEggRoboZTowersCallback)(SuperEggRoboZTowers *, u8);

static void sub_8049F1C(SuperEggRoboZTowers *towers, u8 i);
static void sub_804A070(SuperEggRoboZTowers *towers, u8 i);
static void sub_804A1C0(SuperEggRoboZTowers *towers, u8 i);
static void sub_804A398(SuperEggRoboZTowers *towers, u8 i);
static void sub_804A53C(SuperEggRoboZTowers *towers, u8 i);
static void Task_SuperEggRoboZTowersMain(void);
