#include "core.h"
#include "sprite.h"
#include "task.h"
#include "malloc_vram.h"
#include "trig.h"

#include "game/game.h"
#include "game/save.h"
#include "game/bosses/common.h"
#include "game/bosses/eggmobile_escape_sequence.h"
#include "game/player_callbacks_1.h"

#include "game/screen_fade.h"

#include "lib/m4a.h"
#include "constants/songs.h"
#include "constants/zones.h"
#include "constants/animations.h"
#include "flags.h"

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 x;
    /* 0x08 */ s32 y;

    /* 0x0C */ s16 unkC; // speedX
    /* 0x0E */ s16 unkE; // speedY

    /* 0x10 */ u8 unk10;
    /* 0x11 */ u8 unk11;
    /* 0x12 */ u8 unk12;
    /* 0x13 */ u8 unk13;
    /* 0x14 */ u8 unk14;
    /* 0x15 */ u8 unk15;

    /* 0x16 */ u16 cabinDiskAngle;
    /* 0x18 */ u16 gunDiskAngle;
    /* 0x1A */ u16 unk1A;
    /* 0x1C */ u16 unk1C;

    /* 0x1E */ u8 unk1E;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ u8 unk20;

    /* 0x22 */ s16 unk22;
    /* 0x24 */ s16 unk24;

    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;

    /* 0x30 */ u16 armDiskAngle;
    /* 0x32 */ u16 unk32;

    /* 0x34 */ s16 unk34;

    /* 0x36 */ s16 unk36[2][32];
    /* 0xB6 */ u8 unkB6;

    /* 0xB8 */ s16 unkB8;
    /* 0xBA */ s16 unkBA;
    /* 0xBC */ u16 unkBC;

    /* 0xBE */ u8 armStateTimer;
    /* 0xBF */ u8 armState;
    /* 0xC0 */ u8 unkC0;

    /* 0xC4 */ s32 cabinX;
    /* 0xC8 */ s32 cabinY;

    /* 0xCC */ s32 armBaseX;
    /* 0xD0 */ s32 armBaseY;

    /* 0xD4 */ s16 unkD4;
    /* 0xD6 */ s16 unkD6;

    /* 0xD8 */ s16 unkD8;
    /* 0xDA */ s16 unkDA;

    /* 0xDC */ s32 unkDC[6][2];

    /* 0x10C */ s16 unk10C[6][2];

    /* 0x124 */ s32 handX;
    /* 0x128 */ s32 handY;
    /* 0x12C */ s16 unk12C;
    /* 0x12E */ s16 unk12E;

    /* 0x130 */ s16 introTimer;

    /* 0x134 */ ScreenFade screenTransition;

    /* 0x140 */ Sprite disk;
    /* 0x170 */ Sprite cabin;

    /* 0x1A0 */ Hitbox cabinReserved[2];

    /* 0x1B0 */ Sprite pilot;
    /* 0x1E0 */ Sprite gun;
    /* 0x210 */ Hitbox gunReserved;

    /* 0x218 */ Sprite gunBase;

    /* 0x248 */ Hitbox gunBaseReserved;

    /* 0x250 */ SpriteTransform transform;

    /* 0x25C */ Sprite gunCharge;
    /* 0x28C */ Sprite armBase;
    /* 0x2BC */ Hitbox armReserved;

    /* 0x2C4 */ Sprite armSegment; // arm segment

    /* 0x2F4 */ Sprite hand;
    /* 0x324 */ Hitbox handReserved;

    /* 0x32C */ Sprite smackParticles[8];

    /* 0x4AC */ void *vram;
} EggSaucer; /* 0x4B0 */

// Attack speeds?
const u16 gUnknown_080D7F94[2]
    = { 4 * GBA_FRAMES_PER_SECOND, 8 * GBA_FRAMES_PER_SECOND };

typedef void (*EggSaucerCallback)(EggSaucer *);

static void sub_8044A14(EggSaucer *);
static void sub_8044B28(EggSaucer *);
static void sub_8044CBC(EggSaucer *);
static void sub_8044EB0(EggSaucer *);
static void sub_8044FE4(EggSaucer *);
static void sub_80451C4(EggSaucer *);

static const EggSaucerCallback gArmFunctions[] = {
    sub_8044A14, sub_8044B28, sub_8044CBC, sub_8044EB0, sub_8044FE4, sub_80451C4,
};

static const TileInfo gUnknown_080D7FB0[] = {
    { 2, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_RIGHT, 0 },
    { 4, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_DOWN_RIGHT, 0 },
    { 2, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_DOWN, 0 },
    { 4, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_DOWN_LEFT, 0 },
    { 2, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_LEFT, 0 },
    { 4, SA2_ANIM_EGG_SAUCER_SMACK_PARTICLE_UP_LEFT, 0 },
