#include "global.h"
#include "flags.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/entity.h"
#include "game/bosses/common.h"
#include "game/bosses/boss_3.h"
#include "game/bosses/eggmobile_escape_sequence.h"
#include "game/stage/boss_results_transition.h"
#include "game/parameters/bosses.h"
#include "game/player_callbacks.h"

#include "game/stage/terrain_collision.h"
#include "game/stage/player.h"
#include "game/save.h"
#include "game/stage/screen_shake.h"

#include "constants/animations.h"
#include "constants/songs.h"
#include "constants/zones.h"

typedef struct {
    /* 0x00 */ s32 qWorldX;
    /* 0x04 */ s32 qWorldY;
    /* 0x08 */ s16 qUnk8;
    /* 0x0A */ s16 qUnkA;
    /* 0x0C */ u16 qUnkC; // rotation
    /* 0x0E */ s16 unkE; // dy ?
    /* 0x10 */ u16 unk10;
    /* 0x12 */ u8 unk12;
    /* 0x13 */ u8 unk13;
    /* 0x14 */ u8 unk14; // weapon lives?
    /* 0x15 */ u8 unk15;
    /* 0x16 */ u8 unk16;
    /* 0x17 */ s8 unk17;
    /* 0x18 */ u8 unk18;
    /* 0x19 */ u8 filler19[0x3];
} Totem3C; /* size: 0x1C */

typedef struct {
    /* 0x00 */ s32 qWorldX;
    /* 0x04 */ s32 qWorldY;
    /* 0x08 */ s16 unk8;
    /* 0x08 */ s16 unkA;
    /* 0x0C */ Vec2_32 qWheelPos[EGGTOTEM_NUM_PLATFORMS];
    /* 0x24 */ s16 unk24[EGGTOTEM_NUM_PLATFORMS][2];
    /* 0x30 */ s16 unk30;
    /* 0x32 */ u8 lives;
    /* 0x33 */ u8 unk33;
    /* 0x34 */ u8 unk34;
    /* 0x35 */ u8 unk35;
    /* 0x36 */ u8 unk36;
    /* 0x37 */ u8 unk37;
    /* 0x38 */ u8 unk38;
    /* 0x39 */ u8 unk39; // numExplosions?
    /* 0x3A */ u8 unk3A;
    /* 0x3B */ u8 unk3B;
    /* 0x3C */ Totem3C unk3C[EGGTOTEM_NUM_PLATFORMS];
    /* 0x90 */ s32 qUnk90; // some x
    /* 0x94 */ s32 qUnk94; // some y
    /* 0x98 */ s16 qUnk98; // dx
    /* 0x9A */ s16 qUnk9A; // dy
    /* 0x9C */ s32 qUnk9C; // some x
    /* 0xA0 */ s32 qUnkA0; // some y
    /* 0xA4 */ s16 qUnkA4; // dx
    /* 0xA6 */ s16 qUnkA6; // dy
    /* 0xA8 */ s32 qUnkA8; // some x
    /* 0xAC */ s32 qUnkAC; // some y
    /* 0xB0 */ s16 qUnkB0; // dx
    /* 0xB2 */ s16 qUnkB2; // dy
    /* 0xB4 */ s32 unkB4;
    /* 0xB8 */ s32 qUnkB8; // some x
    /* 0xBC */ s32 qUnkBC; // some y
    /* 0xC0 */ Sprite2 sprC0; // Main body
    /* 0xF8 */ Sprite sprWheels[EGGTOTEM_NUM_PLATFORMS];
    /* 0x188 */ Sprite3 sprPlatform[EGGTOTEM_NUM_PLATFORMS];
    /* 0x248 */ Sprite sprBulletLauncher[2];
    /* 0x2A8 */ Sprite sprPilot;
    /* 0x2D8 */ Sprite sprTails;
    /* 0x308 */ Sprite sprTailsHook;
    /* 0x338 */ Sprite sprBodyEnergy;
    /* 0x368 */ Sprite sprCart;
    /* 0x398 */ void *tilesBullet;
} EggTotem; /* size: 0x39C */

typedef struct {
    /* 0x00 */ s32 qScreenX;
    /* 0x04 */ s32 qScreenY;
    /* 0x08 */ s16 qDX;
    /* 0x0A */ s16 qDY;
    /* 0x0C */ EggTotem *totem;
    /* 0x10 */ Sprite s;
} EggTotemBullet;

typedef struct {
    u16 unk0;
    u16 unk2;
    u16 unk4;
    u16 padding6;
} EggTotemDataA;

static void Task_803F3E8(void);
static void sub_803F4B8(EggTotem *);
static void sub_803F5E0(EggTotem *);
static void sub_803F698(EggTotem *);
static bool32 sub_803F878(EggTotem *totem);
static void sub_803FB88(EggTotem *);
void sub_803FC14(EggTotem *);
void sub_803FF44(EggTotem *);
static bool32 sub_8040B30(EggTotem *totem, u8 i);
static void sub_804063C(EggTotem *);
static void sub_80407A4(EggTotem *);
static void sub_80408C4(EggTotem *);
static void sub_8040A00(EggTotem *);
static void sub_8040D74(EggTotem *);
static void sub_8040E78(EggTotem *);
static void sub_8040F14(EggTotem *);
static void Task_80411CC(void);
static void Task_CallTaskDestroyTotem(void);
static void Totem_UpdateWorldPos(EggTotem *);
static void sub_8041264(EggTotem *);
static void sub_80412B4(EggTotem *);
static void Task_EggTotemMain(void);
static void Task_8041138(void);
