#include "global.h"
#include "flags.h"
#include "malloc_vram.h"
#include "task.h"
#include "trig.h"
#include "lib/m4a/m4a.h"
#include "game/sa1_sa2_shared/camera.h"
#include "game/sa1_sa2_shared/collision.h"

#include "game/game.h" // sub_801E4E4

#include "game/player_callbacks.h"
#include "game/stage/player.h"
#include "game/stage/terrain_collision.h"

#include "game/entity.h" // Coll_Player_Entity_Intersection
#include "game/bosses/common.h"
#include "game/bosses/eggmobile_escape_sequence.h"
#include "game/parameters/bosses.h"

#include "game/stage/screen_shake.h"
#include "game/stage/boss_results_transition.h"

#include "constants/animations.h"
#include "constants/char_states.h"
#include "constants/songs.h"
#include "constants/zones.h"

#define NUM_TAIL_SEGMENTS 3

#define PAL_BOSS_4_DEFAULT 0
#define PAL_BOSS_4_HIT     1

// TODO: Probably these will be globally automated in the long run?
#define AEROEGG_PILOT_OFFSET_X   (0)
#define AEROEGG_PILOT_OFFSET_Y   (-14)
#define AEROEGG_TAILTIP_OFFSET_X (0)
#define AEROEGG_TAILTIP_OFFSET_Y (20)

#define AEROEGG_COOLDOWN_NORMAL ZONE_TIME_TO_INT(0, 2. + (1. / 3.))
#define AEROEGG_COOLDOWN_PINCH  ZONE_TIME_TO_INT(0, 1. + (1. / 3.))

#define RESERVED_EXPLOSION_TILES_VRAM (void *)(OBJ_VRAM0 + 0x2980)

static const u16 sPalAeroEggHit[2][PALETTE_LEN_4BPP] = {
    [PAL_BOSS_4_DEFAULT] = INCBIN_U16("graphics/boss_4_a.gbapal"),
    [PAL_BOSS_4_HIT] = INCBIN_U16("graphics/boss_4_b.gbapal"),
};

typedef struct {
    /* 0x00 */ s32 x;
    /* 0x04 */ s32 y;
    /* 0x08 */ s32 dx;
    /* 0x0C */ s32 dy;
    /* 0x10 */ bool32 status; // TODO: Is this actually 2 16bit values?
} AeroEggPart; /* size: 0x14 */

typedef struct {
    /* 0x000 */ s32 unk0;
    /* 0x004 */ s32 qWorldX;
    /* 0x008 */ s32 qWorldY;
    /* 0x00C */ s16 dx;
    /* 0x00E */ s16 dy;
    /* 0x010 */ u16 timerUnk;
    /* 0x012 */ u16 timerBombDrop;
    /* 0x014 */ u8 lives;
    /* 0x015 */ u8 unk15;
    /* 0x016 */ u8 unk16;
    /* 0x017 */ u8 unk17;
} AeroEggMain;

typedef struct {
    /* Full  Sub   */
    /* 0x018 0x00  */ u32 unk00;
    /* 0x01C 0x04  */ AeroEggPart body;
    /* 0x030 0x18  */ AeroEggPart tail[NUM_TAIL_SEGMENTS];
    /* 0x06C 0x54  */ AeroEggPart tailTip;
    /* 0x080 0x68  */ s8 unk68;
    /* 0x081 0x69  */ u8 unk69; // explosion parts count?
    /* 0x082 0x6A  */ u8 unk6A;
    /* 0x083 0x6B  */ u8 unk6B;
    /* 0x084 0x6C  */ u8 unk6C;
    /* 0x085 0x6D  */ u8 filler85[0x3];
    /* 0x088 0x70  */ Sprite sprBody;
    /* 0x0B8 0xA0  */ Hitbox reserved;
    /* 0x0C0 0xA8  */ Sprite sprPilot;
    /* 0x0F0 0xD8  */ Sprite sprTail;
    /* 0x120 0x108 */ Sprite sprTailTip;
    /* 0x150 0x138 */ void *tilesBomb;
} AeroEggSub;

typedef struct {
    /* 0x00 */ AeroEggMain main;
    /* 0x18 */ AeroEggSub sub;
} AeroEgg; /* size: 0x154 */

typedef struct {
    /* 0x00 */ u32 tAlive;
    /* 0x04 */ s32 screenX;
    /* 0x08 */ s32 screenY;
    /* 0x0C */ s16 dx;
    /* 0x0E */ s16 dy;
    /* 0x10 */ AeroEgg *boss;
    /* 0x14 */ Sprite s;
} AeroEggBomb; /* size: 0x44 */

typedef AeroEggBomb AeroEggDebris; /* size: 0x44 */

static void Task_CreateAeroEggBombMain(void);
static void Task_DeleteAeroEggBombTask(void);
static void Task_AeroEggBombDebris(void);
static void Task_AeroEggExploding(void);
static void Task_80426C4(void);
static void Task_DeleteAeroEggTask(void);
static void Task_AeroEggBombHitGround(void);
static void sub_8041B44(AeroEgg *boss);
static void sub_8041880(AeroEgg *boss);
static void sub_8041A08(AeroEgg *boss);
void sub_8041D34(AeroEgg *boss);
static void AeroEgg_CreateBombIfReady(AeroEgg *boss);
void AeroEgg_InitPartsDefeated(AeroEgg *boss);
static bool32 sub_80423EC(AeroEgg *boss);
static void sub_80424EC(AeroEgg *boss);
static void sub_8042560(AeroEgg *boss);
static void Task_AeroEggMain(void);
static void sub_8042774(AeroEgg *boss);
static void TaskDestructor_AeroEggMain(struct Task *t);

void CreateAeroEggBomb(AeroEgg *boss, s32 spawnX, s32 spawnY);
