#include "core.h"
#include "sprite.h"
#include "malloc_vram.h"
#include "trig.h"
#include "game/sa1_sa2_shared/globals.h"
#include "game/sa1_sa2_shared/collision.h"

#include "game/stage/terrain_collision.h"
#include "game/stage/camera.h"
#include "game/player_callbacks.h"
#include "game/stage/player.h"

#include "game/bosses/common.h"
#include "game/bosses/eggmobile_escape_sequence.h"
#include "game/stage/boss_results_transition.h"
#include "game/cheese.h"

#include "lib/m4a/m4a.h"

#include "constants/zones.h"
#include "constants/animations.h"
#include "constants/songs.h"

#define NUM_WHEELS              6
#define CANNON_MOVE_SPEED       82
#define CANNON_RELOAD_FRAMES    12
#define CANNON_RETRIGGER_FRAMES 150

typedef struct {
    /* 0x00 */ s32 qWorldX;
    /* 0x04 */ s32 qWorldY;
    /* 0x08 */ s16 qSpeedX;
    /* 0x0A */ s16 qSpeedY;
    /* 0x0C */ s32 qWheelPositions[NUM_WHEELS][2];
    /* 0x3C */ s16 unk3C[NUM_WHEELS][2];
    // Cannon ball maybe?
    /* 0x54 */ s32 unk54;
    /* 0x58 */ s32 unk58;
    /* 0x5C */ s16 unk5C;
    /* 0x5E */ s16 unk5E;
    /* 0x60 */ s16 cannonAngle;
    /* 0x64 */ s32 cannonStep;
    /* 0x68 */ u32 timer;
    /* 0x6C */ void *vram;

    /* 0x70 */ u8 health;
    /* 0x71 */ u8 cannonHealth;

    /* 0x72 */ u8 bossHitTimer;
    /* 0x73 */ u8 unk73;
    /* 0x74 */ u8 unk74;
    /* 0x75 */ u8 unk75;
    /* 0x76 */ u8 unk76;
    /* 0x77 */ u8 unk77;
    /* 0x78 */ u8 cannonHitTimer;

    /* 0x7C */ u32 introTimer;

    /* 0x80 */ Sprite body;
    /* 0xB0 */ Hitbox reserved;

    /* 0xB8 */ Sprite brokenBody;
    /* 0xE8 */ Sprite wheels[2];
    /* 0x148 */ Sprite cannon;
    /* 0x178 */ SpriteTransform transform;
    /* 0x184 */ Sprite pilot;
} EggBomberTank; /* size: 0x1B4 */

typedef struct {
    s32 x;
    s32 y;
    s16 speedX;
    s16 speedY;
    u8 explodeTimer;
    EggBomberTank *boss;
    Sprite s;
} EggBomberTankBomb; /* 0x44*/

typedef struct {
    void *vram;
    AnimId anim;
    u8 variant;
} ExplosionGraphics;

typedef void (*BossFunction)(EggBomberTank *boss);

static void Task_EggBomberTankIntro(void);
static void Task_BomberTankMain(void);
static void Task_StartBossDestruction(void);
static void Task_WaitForBossOffScreen(void);

static void TaskDestructor_EggBomberTankMain(struct Task *);

static void UpdateWheelPositions(EggBomberTank *boss);
static bool8 HandleCannonCollision(EggBomberTank *boss);
static bool8 RenderCannon(EggBomberTank *boss);
static void UpdatePilotAnimation(EggBomberTank *boss);
static u8 RenderEggBomberTank(EggBomberTank *boss);
static void UpdateBomberTankPalette(EggBomberTank *boss);
static void UpdateCannonAngle(EggBomberTank *boss);
